---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle
source: html/bbab575d-e7bd-fd9a-add6-931fa83a431a.htm
---
# IndexStreamTriangle Methods

Inserts a IndexTriangle into the stream and associated buffer.